Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/money_and_tax/personal_finance/debt/credit_ratings.html.txt.tmx
Source language: en
Languages: ga

source: • Getting a copy of your credit record
ga: • Cóip de do thaifead creidmheasa a fháil

source: Banks and other lenders generally send information about borrowers to a central database that is operated by a credit reference agency or credit register
ga: Go ginearálta, seolann bainc agus iasachtóirí eile faisnéis faoi iasachtaithe chuig bunachar sonraí lárnach atá á oibriú ag gníomhaireacht teistiméireachta creidmheasa nó clár creidmheasa

source: This information includes what credit agreements you have made and your history of repaying them
ga: Áirítear leis an bhfaisnéis seo na comhaontuithe creidmheasa a rinne tú agus do stair maidir le hiad a íoc

source: It is used to generate a credit rating or credit score, which indicates whether your credit repayment record is good or poor
ga: Úsáidtear iad chun rátáil chreidmheasa nó scór creidmheasa a chruthú, a thugann le fios cibé acu an bhfuil do thaifead aisíocaíochta creidmheasa go maith nó go holc

source: The database is available for lenders to consult to see if potential borrowers have ever defaulted on loans
ga: Tá fáil ag iasachtóirí ar an mbunachar sonraí chun dul i gcomhairle féachaint ar theip ar iasachtaithe féideartha riamh iasachtaí a íoc

source: The aim of the system is to help lenders to assess the ability of borrowers to repay any future debts
ga: Is í aidhm an chórais cabhrú le hiasachtóirí rochtain a fháil ar chumas iasachtaithe aon fhiachas amach anseo a aisíoc

source: Credit Reporting Act 2013
ga: An tAcht um Thuairisciú Creidmheasa 2013

source: The Credit Reporting Act 2013 came into effect on 27 January 2014
ga: Tháinig an tAcht um Thuairisciú Creidmheasa 2013 i bhfeidhm ar 27 Eanáir 2014

source: It provides for the establishment and operation of a statutory Central Credit Register (CCR) system
ga: Forálann sé do bhunú agus oibriú córas Clár Lárnach Creidmheasa (CLC) reachtúil

source: Credit providers will be required to report a comprehensive range of credit information
ga: Ceanglófar ar sholáthróirí creidmheasa chun réimse cuimsitheach d’fhaisnéis chreidmheasa a thuairisciú

source: They will be obliged to check with the Register for all applications for credit above €2,000 in value
ga: Ina theannta sin, beidh dualgas orthu seiceáil leis an gClár i dtaobh gach iarratais ar chreidmheas os cionn luach €2,000

source: Consumers will be entitled to get one free copy of their record every 12 months
ga: Beidh tomhaltóirí i dteideal cóip amháin saor in aisce a fháil dá dtaifead gach 12 mhí

source: Read more about the Act in this press release
ga: Is féidir níos mó a léamh faoin Acht sa phreaseisiúint seo

source: The Central Credit Register will be established and operated by the Central Bank of Ireland, which has published regulations governing its operation
ga: Cuirfidh Banc Ceannais na hÉireann an Clár Lárnach Creidmheasa ar bun agus oibreoidh an Banc é freisin. Tá rialacháin foilsithe ag an mBanc chun oibriú an Chláir a rialú

source: It is expected to start producing credit reports after December 2017
ga: Is cosúil go dtosóidh an Clár ar thuairiscí creidmheasa a sholáthar tar éis mí na Nollag 2017

source: Credit reference agencies collect both negative information and positive information about consumers
ga: Bailíonn gníomhaireachtaí teistiméireachta creidmheasa faisnéis dhiúltach agus dhearfach araon faoi thomhaltóirí

source: Negative information is information about any default on credit repayments, such as arrears, missed payments and bankruptcies
ga: Is ionann faisnéis dhiúltach agus faisnéis faoi aon teip ar aisíocaíochtaí creidmheasa, ar nós riaráistí, íocaíochtaí caillte agus féimheacht

source: Positive information is information relating to your overall financial standing, such as your overdraft limit, the limit on your credit card and records of your repayments
ga: Is ionann faisnéis dhearfach agus faisnéis a bhaineann le do staid fhoriomlán airgeadais, ar nós do theorainn rótharraingte, an teorainn ar do chárta creidmheasa agus taifid ar d’aisíocaíochtaí

source: The main credit reference agency for individuals in Ireland is the Irish Credit Bureau (ICB) but there are several other agencies, mainly dealing with businesses
ga: Is iad an phríomhghníomhaireacht teistiméireachta creidmheasa do dhaoine aonair in Éirinn Biúró Creidmheasa na hÉireann (ICB) ach tá roinnt gníomhaireachtaí eile ann, a dhéileálann go príomha le gnólachtaí

source: The ICB compiles a private database of information supplied by its members, which are the main financial institutions, including some credit unions
ga: Bailíonn an BCÉ bunachar sonraí príobháideach faisnéise a sholáthraíonn a gcomhaltaí, arb iad na príomhinstitiúidí airgeadais, lena n-áirítear roinnt comhair chreidmheasa

source: Local authorities are also members
ga: Tá údaráis áitiúla ina gcomhaltaí chomh maith

source: Membership does not include utility companies or retail outlets
ga: Ní féidir le cuideachtaí fóntais nó asraonta miondíola bheith ina gcomhaltaí

source: The database includes information on a wide range of loans, including personal loans, mortgages and credit card loans
ga: Áirítear leis an mbunachar sonraí faisnéis ar réimse fairsing iasachtaí, lena n-áirítear iasachtaí pearsanta, morgáistí agus iasachtaí cárta creidmheasa

source: That information is available only to members of the ICB (and, of course, to yourself)
ga: Níl an fhaisnéis ar fáil ach do chomhaltaí an BCÉ (agus, dar ndóigh, duit féin)

source: The ICB does not decide whether or not you get a loan
ga: Ní dhéanann an BCÉ cinneadh ar cibé acu an dtabharfar nó nach dtabharfar iasacht duit

source: Financial institutions use the information held by the ICB when deciding whether or not to lend to you
ga: Úsáideann institiúidí airgeadais an fhaisnéis atá á coimeád ag an BCÉ nuair a bhíonn cinneadh á dhéanamh faoi cibé acu iasacht a thabhairt duit nó a mhalairt

source: International credit rating agencies (for example, Moody’s, Fitch’s, Standard and Poor’s) generally assess business debts and have little relevance to consumers
ga: Is gnách go ndéanann gníomhaireachtaí idirnáisiúnta rátála creidmheasa (mar shampla, Moody’s, Fitch’s, Standard agus Poor’s) measúnú ar fhiachas gnó agus is beag a bhaineann siad le tomhaltóirí

source: The Irish Credit Bureau’s database will only hold information about you if you have had an active loan in the past 5 years and if your lender has provided information to the ICB
ga: Ní choimeádfaidh bunachar sonraí Bhiúró Creidmheasa na hÉireann faisnéis fút ach má bhí iasacht ghníomhach agat le 5 bliana anuas agus má sholáthair d’iasachtóir faisnéis don BCÉ

source: The information is held in an individual credit report
ga: Coimeádtar an fhaisnéis i dtuairisc aonair chreidmheasa

source: • Your name, date of birth, address(es) used by you in relation to financial transactions
ga: • D’ainm, dáta breithe, seoladh/seoltaí a d’úsáid tú maidir le hidirbhearta airgeadais

source: • Names of lenders and account numbers of loans that you currently hold, or that were active within the last 5 years
ga: • Ainmneacha iasachtóirí agus uimhreacha cuntais iasachtaí atá agat faoi láthair, nó a bhí gníomhach le 5 bliana anuas

source: • Repayments made or missed for each month on each loan
ga: • Aisíocaíochtaí a rinneadh nó a cailleadh in aghaidh na míosa ar gach iasacht

source: • Failure to clear off any loan
ga: • Aon teip ar aon iasacht a ghlanadh

source: • Loans that were settled for less than you owed and
ga: • Iasachtaí a réitíodh ar mhéid níos lú ná a bhí le híoc agat, agus

source: • Legal actions that your lender took against you
ga: • Caingne dlí a ghlac d’iasachtóir i do leith

source: The system records when a lender has consulted it, so you can find out if this happened in your case
ga: Cuireann an córas i dtaifead nuair a chuaigh tú i gcomhairle leis, ionas gur féidir leat a dheimhniú má tharla seo i do chás

source: Every financial institution that is a member of the ICB is required to provide you with details of any credit reference agency it has used when assessing your application for a loan
ga: Ceanglaítear ar gach institiúid airgeadais atá mar chomhalta an BCÉ chun sonraí faoi aon ghníomhaireacht teistiméireachta creidmheasa a sholáthar duit a úsáideadh agus measúnú á dhéanamh ar d’iarratas ar iasacht

source: Credit agencies may publish lists of judgments registered in the Central Office of the High Court (for example, such lists are published in Stubbs Gazette and some newspapers)
ga: Féadfaidh gníomhaireachtaí creidmheasa liostaí breithiúnas a fhoilsiú a cláraíodh i Lár-Oifig na hArd-Chúirte (mar shampla, foilsítear na liostaí siúd in Stubbs Gazette agus i roinnt nuachtán)

source: This is public information
ga: Is ionann seo agus faisnéis phoiblí

source: You have no control over its publication or the use that is made of it
ga: Níl aon smacht agat ar a fhoilsiú ná ar an úsáid a bhaintear as

source: Summary of your credit status
ga: Achoimre ar do stádas creidmheasa

source: Credit scoring is a technique which summarises your credit status at a particular point in time
ga: Teicníc atá i scóráil creidmheasa a dhéanann achoimriú ar do stádas creidmheasa ag pointe áirithe ama

source: The ICB will calculate a Credit Bureau Score (CBS) based on your credit report if a lender requests it (only if the lender is an ICB member)
ga: Ríomhfaidh an BCÉ Scór Biúró Creidmheasa (SBC) bunaithe ar do thuairisc chreidmheasa má iarrann iasachtóir air (ach amháin más comhalta BCÉ an t-iasachtóir)

source: If you have a good record of repaying loans, then you get a high score
ga: Má tá dea-thaifead agat maidir le hiasachtaí a aisíoc, tugtar ardscór duit

source: You get a low score if your repayment record is poor
ga: Tugtar ísealscór duit má tá drochthaifead aisíocaíochta agat

source: The only way to improve your credit score is to improve your repayment record
ga: Is é an t-aon bhealach chun feabhas a chur ar do scór creidmheasa do thaifead aisíocaíochta a fheabhsú

source: Your consent is required for the provision of information about your credit history to the Irish Credit Bureau
ga: Tá do thoiliú ag teastáil chun faisnéis faoi do stair chreidmheasa a thabhairt do Bhiúró Creidmheasa na hÉireann

source: However, it is sometimes the practice that such consent is an integral part of your credit agreement, so you may not notice that you have given consent
ga: Mar sin féin, tarlaíonn sé, corruair, go mbíonn an toiliú sin mar chuid lárnach do de chomhaontú creidmheasa, mar sin, tharlódh nár thug tú faoi deara gur thug tú toiliú

source: You have the usual rights under data protection legislation (pdf) to access the records held about you by credit agencies and to have incorrect information rectified
ga: Tá na gnáthchearta agat faoin reachtaíocht um chosaint sonraí (pdf) chun rochtain a fháil ar na taifid atá á gcoimeád ag gníomhaireachtaí creidmheasa fút agus go gceartaítear aon fhaisnéis mhícheart

source: You may ask the agency to provide you with a copy of the personal information it holds about you
ga: Is féidir leat iarraidh ar an ngníomhaireacht cóip den fhaisnéis phearsanta atá á coimeád acu fút a thabhairt duit

source: If this is inaccurate, you may ask the agency to correct it
ga: Má tá sí míchruinn, féadfaidh tú iarraidh ar an ngíomhaireacht í a cheartú

source: If you are not satisfied with how the agency deals with you, you may appeal to the Data Protection Commissioner
ga: Mura bhfuil tú sásta leis an mbealach a chaitheann an ghníomhaireacht leat, is féidir leat achomharc a dhéanamh leis an gCoimisinéir Cosanta Sonraí

source: Requirement to consult information on databases
ga: Ceanglas chun dul i gcomhairle faisnéise ar bhunachair shonraí

source: The European Communities (Consumer Credit Agreements) Regulations 2010 (SI 281/2010) provide that creditors, before agreeing to give you a loan, are obliged to assess your creditworthiness based on sufficient information obtained from you and, where necessary, from a database of such information
ga: Forálann Rialacháin na gComhphobal Eorpach (Comhaontuithe maidir le Creidmheas do Thomhaltóra), 2010 (IR 281/2010) go gceanglaítear ar chreidiúnaithe, sula gcomhaontaíonn siad chun iasacht a thabhairt duit, measúnú a dhéanamh ar d'acmhainneacht chreidmheasa, bunaithe ar fhaisnéis leordhóthanach a fuarthas uait agus, sa chás gur cuí, ó bhunachar sonraí den fhaisnéis sin

source: They also provide that, if you are refused credit because of the information found on the database, the creditor must immediately tell you this and give you particulars of the database used
ga: Forálann siad chomh maith, má dhiúltaítear creidmheas a thabhairt duit mar gheall ar an bhfaisnéis a fuarthas ar bhunachar sonraí, ní mór don chreidiúnaí é seo a insint duit láithreach agus sonraí maidir leis an mbunachar sonraí a úsáideadh a thabhairt duit

source: This legislation applies to personal consumer credit agreements for amounts between €200 and €75,000 and it does not apply to mortgages
ga: Baineann an reachtaíocht seo le comhaontuithe pearsanta creidmheasa do thomhaltóirí ar shuimeanna idir €200 agus €75,000 agus ní bhaineann sé le morgáistí

source: At present, there is no regulation of such agencies
ga: Faoi láthair, níl na gníomhaireachtaí seo á rialú

source: There is an EU proposal to regulate credit rating agencies
ga: Ach is ann do thogra AE chun gníomhaireachtaí rátála creidmheasa a rialú

source: Getting a copy of your credit record
ga: Cóip de do thaifead creidmheasa a fháil

source: You can get a copy of your credit record by applying online to the Irish Credit Bureau and paying €6
ga: Féadfaidh tú cóip de do thaifead creidmheasa a fháil trí iarratas a dhéanamh ar líne le Biúró Creidmheasa na hÉireann agus trí €6 a íoc

source: For security reasons, it will be posted out to you
ga: Ar mhaithe le húdair shlándála, déanfar é a sheoladh sa phost chugat

source: It will not be emailed
ga: Ní dhéanfar é a sheoladh chugat ar ríomhphost

source: Alternatively, you can download a Personal Enquiry Form (pdf) or request an application form
ga: Mar mhalairt air sin, féadfaidh tú Foirm Fiosrúcháin Phearsanta (pdf) a íoslódáil nó iarraidh ar fhoirm iarratais

source: Send the completed application form with payment of €6 to the address below
ga: Seol an fhoirm chomhlánaithe iarratais le híocaíocht €6 chuig an seoladh thíos

source: Only 1 search can be conducted per application, and the ICB takes about 3 or 4 days to process each one
ga: Ní féidir ach cuardach amháin a dhéanamh in aghaidh an iarratais, agus glacann sé thart ar 3 nó 4 lá ar an BCÉ chun gach ceann a phróiseáil

source: The report that the ICB issues will display a unique reference number
ga: Taispeánfaidh an tuairisc a eisíonn an BCÉ uimhir uathúil thagartha

source: You may then contact the ICB to discuss your report, quoting this unique number
ga: Is féidir leat teagmháil a dhéanamh leis an BCÉ, ansin, chun do thuairisc a phlé, agus an uimhir uathúil seo a lua

source: You cannot discuss your credit record with the ICB by phone until you have received the report
ga: Ní féidir leat do thaifead creidmheasa a phlé leis an BCÉ ar an nguthán go dtí go bhfuil an tuairisc faighte agat

source: If you wish to have inaccurate information on your credit record amended, contact the lender concerned and ask them to forward the correct information to the ICB
ga: Más mian leat go leasófar faisnéis mhíchruinn atá ar do thaifead creidmheasa, déan teagmháil le d'iasachtóir agus iarr orthu an t-eolas cruinn a sheoladh chuig BCÉ

source: The ICB cannot change the information unless asked to do so by the relevant lender
ga: Ní féidir le BCÉ an taifead a athrú ach amháin tar éis dóibh iarratas a fháil ó iasachtóir

source: The ICB has published further information about credit ratings
ga: D’fhoilsigh an BCÉ tuilleadh faisnéise faoi rátálacha creidmheasa
